using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;

namespace Uslovshina41
{
    class Program
    {
        static void Main(string[] args)
        {
            /*41.	Даны координаты трех точек на плоскости. Если они могут быть вершинами
             * остроугольного треугольника, вывести их в порядке убывания, вычислить площадь полученного треугольника.*/
            int X1 = 0, X2 = 0, X3 = 0, Y1 = 0, Y2 = 0, Y3 = 0;
            Console.WriteLine("Добро пожаловать в программу, вычисляющую площадь /end остроугольного треугольника по координатам его точек");
            Console.ReadLine();
        }
    }
}
