#12. Смешано V1 литров воды температуры t1 с V2 литрами воды температуры t2. Составить программу вычисления объема и температуры образованной смеси.
"""print('Введи объем первого сосуда: ')
V1 = int(input(''))
print('Введи температуру первого сосуда: ')
t1 = int(input(''))
print('Введи объем второго сосуда: ')
V2 = int(input(''))
print('Введи температуру второго сосуда: ')
t2 = int(input(''))
print('Конечный объем равен {} л.'.format(V1 + V2))
print('Конечная температура равна {} градусов.'.format((V1*t1 + V2*t2)/(V1 + V2)))
"""
q="'";s='q="";s=;print(s[:3]+q+s[3:7]+q+s+q+s[7:])';print(s[:3]+q+s[3:7]+q+s+q+s[7:])